연금술사
해로운 포션 면역 I
해로운 포션에 20% 면역이 됩니다.
해로운 포션 면역 II
해로운 포션에 40% 면역이 됩니다.
해로운 포션 면역 III
해로운 포션에 60% 면역이 됩니다.
해로운 포션 면역 IV
해로운 포션에 80% 면역이 됩니다.
해로운 포션 면역 V
해로운 포션에 100% 면역이 됩니다.
직업 경험치 I
직업 경험치를 1.5배로 증가시킵니다.
직업 경험치 II
직업 경험치를 2배로 증가시킵니다.
직업 경험치 III
직업 경험치를 3배로 증가시킵니다.
포션 지속시간 증가 I
포션 지속 시간이 20% 증가합니다.
포션 지속시간 증가 II
포션 지속 시간이 40% 증가합니다.
포션 지속시간 증가 III
포션 지속 시간이 60% 증가합니다.
포션 지속시간 증가 IV
포션 지속 시간이 80% 증가합니다.
포션 지속시간 증가 V
포션 지속 시간이 100% 증가합니다.
강화 포션 I
포션이 더 강해질 확률이 20% 있습니다.
강화 포션 II
포션이 더 강해질 확률이 40% 있습니다.
강화 포션 III
포션이 더 강해질 확률이 60% 있습니다.
강화 포션 IV
포션이 더 강해질 확률이 80% 있습니다.
강화 포션 V
포션이 더 강해질 확률이 100% 있습니다.
건축가
추락 피해 감소 I
추락 피해가 20% 감소합니다.
추락 피해 감소 II
추락 피해가 40% 감소합니다.
추락 피해 감소 III
추락 피해가 60% 감소합니다.
굴착공
더블드롭 I
파괴 시 드롭이 두 배가 될 확률이 5% 증가합니다.
더블드롭 II
파괴 시 드롭이 두 배가 될 확률이 10% 증가합니다.
더블드롭 III
파괴 시 드롭이 두 배가 될 확률이 20% 증가합니다.
골드 디거 I
파괴 시 1% 확률로 금 괴를 발견합니다.
골드 디거 II
파괴 시 3% 확률로 금 괴를 발견합니다.
골드 디거 III
파괴 시 5% 확률로 금 괴를 발견합니다.
골드 디거 IV
파괴 시 0.5% 확률로 금 블록을 발견합니다.
골드 디거 V
파괴 시 1% 확률로 금 블록을 발견합니다.
삽 효율 I
삽의 채굴 속도가 10% 빨라집니다.
삽 효율 II
삽의 채굴 속도가 20% 빨라집니다.
삽 효율 III
삽의 채굴 속도가 30% 빨라집니다.
삽 효율 IV
삽의 채굴 속도가 40% 빨라집니다.
삽 효율 V
삽의 채굴 속도가 50% 빨라집니다.
삽 내구성 I
삽 사용 시 내구도가 감소할 확률이 10% 줄어듭니다.
삽 내구성 II
삽 사용 시 내구도가 감소할 확률이 20% 줄어듭니다.
삽 내구성 III
삽 사용 시 내구도가 감소할 확률이 30% 줄어듭니다.
삽 내구성 IV
삽 사용 시 내구도가 감소할 확률이 40% 줄어듭니다.
삽 내구성 V
삽 사용 시 내구도가 감소할 확률이 50% 줄어듭니다.
인첸터
경험치 증가 I
블록과 몹에서 얻는 경험치가 1.5배 증가합니다.
경험치 증가 II
블록과 몹에서 얻는 경험치가 2배 증가합니다.
경험치 증가 III
블록과 몹에서 얻는 경험치가 2.5배 증가합니다.
직업 경험치 I
직업 경험치를 1.5배로 증가시킵니다.
직업 경험치 II
직업 경험치를 2배로 증가시킵니다.
직업 경험치 III
직업 경험치를 3배로 증가시킵니다.
농부
더블드롭 I
작물을 수확할 때 드롭이 두 배가 될 확률이 5% 증가합니다.
더블드롭 II
작물을 수확할 때 드롭이 두 배가 될 확률이 10% 증가합니다.
더블드롭 III
작물을 수확할 때 드롭이 두 배가 될 확률이 20% 증가합니다.
직업 경험치 I
직업 경험치를 1.5배로 증가시킵니다.
직업 경험치 II
직업 경험치를 2배로 증가시킵니다.
직업 경험치 III
직업 경험치를 3배로 증가시킵니다.
낚시꾼
갈고리 낚싯대 I
낚싯대를 갈고리 낚싯대로 바꾸어, 특정 위치로 자신을 끌어당길 수 있습니다.
갈고리 낚싯대 II
갈고리 낚싯대가 더 먼 거리로 당신을 끌어당깁니다.
갈고리 낚싯대 III
갈고리 낚싯대가 더욱 먼 거리로 당신을 끌어당깁니다.
직업 경험치 I
직업 경험치를 1.5배로 증가시킵니다.
직업 경험치 II
직업 경험치를 2배로 증가시킵니다.
직업 경험치 III
직업 경험치를 3배로 증가시킵니다.
사냥꾼
공격 속도 I
공격 속도가 10% 증가합니다.
공격 속도 II
공격 속도가 20% 증가합니다.
공격 속도 III
공격 속도가 30% 증가합니다.
공격 속도 IV
공격 속도가 40% 증가합니다.
공격 속도 V
공격 속도가 50% 증가합니다.
활 내구성 I
활 사용 시 내구도가 감소할 확률이 10% 줄어듭니다.
활 내구성 II
활 사용 시 내구도가 감소할 확률이 20% 줄어듭니다.
활 내구성 III
활 사용 시 내구도가 감소할 확률이 30% 줄어듭니다.
활 내구성 IV
활 사용 시 내구도가 감소할 확률이 40% 줄어듭니다.
활 내구성 V
활 사용 시 내구도가 감소할 확률이 50% 줄어듭니다.
화염 화살 I
화살이 25% 확률로 점화 효과를 부여합니다.
화염 화살 II
화살이 50% 확률로 점화 효과를 부여합니다.
화염 화살 III
화살이 100% 확률로 점화 효과를 부여합니다.
다중 화살 I
활이 10% 확률로 화살 3발을 발사합니다.
다중 화살 II
활이 25% 확률로 화살 3발을 발사합니다.
다중 화살 III
활이 25% 확률로 화살 5발을 발사합니다.
다중 화살 IV
활이 50% 확률로 화살 5발을 발사합니다.
검 내구성 I
검 사용 시 내구도가 감소할 확률이 10% 줄어듭니다.
검 내구성 II
검 사용 시 내구도가 감소할 확률이 20% 줄어듭니다.
검 내구성 III
검 사용 시 내구도가 감소할 확률이 30% 줄어듭니다.
검 내구성 IV
검 사용 시 내구도가 감소할 확률이 40% 줄어듭니다.
검 내구성 V
검 사용 시 내구도가 감소할 확률이 50% 줄어듭니다.
벌목가
도끼 효율 I
도끼로 나무를 베는 속도가 10% 빨라집니다.
도끼 효율 II
도끼로 나무를 베는 속도가 20% 빨라집니다.
도끼 효율 III
도끼로 나무를 베는 속도가 30% 빨라집니다.
도끼 효율 IV
도끼로 나무를 베는 속도가 40% 빨라집니다.
도끼 효율 V
도끼로 나무를 베는 속도가 50% 빨라집니다.
도끼 내구성 I
도끼 사용 시 내구도가 감소할 확률이 10% 줄어듭니다.
도끼 내구성 II
도끼 사용 시 내구도가 감소할 확률이 20% 줄어듭니다.
도끼 내구성 III
도끼 사용 시 내구도가 감소할 확률이 30% 줄어듭니다.
도끼 내구성 IV
도끼 사용 시 내구도가 감소할 확률이 40% 줄어듭니다.
도끼 내구성 V
도끼 사용 시 내구도가 감소할 확률이 50% 줄어듭니다.
더블드롭 I
나무를 벨 때 드롭이 두 배가 될 확률이 5% 증가합니다.
더블드롭 II
나무를 벨 때 드롭이 두 배가 될 확률이 10% 증가합니다.
더블드롭 III
나무를 벨 때 드롭이 두 배가 될 확률이 20% 증가합니다.
광부
더블드롭 I
채굴 시 드롭이 두 배가 될 확률이 5% 증가합니다.
더블드롭 II
채굴 시 드롭이 두 배가 될 확률이 10% 증가합니다.
더블드롭 III
채굴 시 드롭이 두 배가 될 확률이 20% 증가합니다.
곡괭이 효율 I
곡괭이 채굴 속도가 10% 빨라집니다.
곡괭이 효율 II
곡괭이 채굴 속도가 20% 빨라집니다.
곡괭이 효율 III
곡괭이 채굴 속도가 30% 빨라집니다.
곡괭이 효율 IV
곡괭이 채굴 속도가 40% 빨라집니다.
곡괭이 효율 V
곡괭이 채굴 속도가 50% 빨라집니다.
곡괭이 내구성 I
곡괭이 사용 시 내구도가 감소할 확률이 10% 줄어듭니다.
곡괭이 내구성 II
곡괭이 사용 시 내구도가 감소할 확률이 20% 줄어듭니다.
곡괭이 내구성 III
곡괭이 사용 시 내구도가 감소할 확률이 30% 줄어듭니다.
곡괭이 내구성 IV
곡괭이 사용 시 내구도가 감소할 확률이 40% 줄어듭니다.
곡괭이 내구성 V
곡괭이 사용 시 내구도가 감소할 확률이 50% 줄어듭니다.
대장장이
방어구 내구성 I
피격 시 방어구 내구도가 감소할 확률이 10% 줄어듭니다.
방어구 내구성 II
피격 시 방어구 내구도가 감소할 확률이 20% 줄어듭니다.
방어구 내구성 III
피격 시 방어구 내구도가 감소할 확률이 30% 줄어듭니다.
방어구 내구성 IV
피격 시 방어구 내구도가 감소할 확률이 40% 줄어듭니다.
방어구 내구성 V
피격 시 방어구 내구도가 감소할 확률이 50% 줄어듭니다.
직업 경험치 I
직업 경험치를 1.5배로 증가시킵니다.
직업 경험치 II
직업 경험치를 2배로 증가시킵니다.
직업 경험치 III
직업 경험치를 3배로 증가시킵니다.